ProjectManager/app/controllers/projects_controller.rb

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "visible", "completed", "updated_at", "priority", "description", "created_at") VALUES('ProjectManager', 't', 'f', '2009-07-02 09:08:11', 0.5, 'A simple webapp to manage the many projects of a technologist. Aimed at collecting ALL the projects rather than an authoritative source on one project.', '2009-07-02 09:08:11')

  def find_post
        @project = Project.find(params[:id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)